<!DOCTYPE html>
<html lang="es">
    <head>
        <style>
        #customers {
            font-family: "Trebuchet MS", Arial, Helvetica, sans-serif;
            border-collapse: collapse;
            width: 100%;
        }
        
        #customers td, #customers th {
            padding: 8px;
        }
        
        #customers tr:nth-child(even)
        
        #customers tr:hover {background-color: #6faee6;}
        #customers td:hover {background-color: #6faee6;}
        #customers th:hover {background-color: #6faee6;}

        #customers th {
            padding-top: 12px;
            padding-bottom: 12px;
            text-align: left;
        }
        </style>

    <meta charset="UTF-8">
    <meta name="viewport" content="">
    <link rel="stylesheet" href="Style.css">
    <title> Linea del tiempo </title>
</head>

<body>
    <br>
    <br>
    <div>
        <img src="Logo1.png"> 
        <IMG SRC="Logo2.png" ALIGN=RIGHT height="150" width="150">
        <center><iframe width="560" height="315" src="https://www.youtube.com/embed/6nR6ed7w0X0?si=JfIBf3S0tZrcV2BK" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen></iframe></center>
    </div>

    <center> <h1>   Linea del tiempo </h1> </center>

<center> <table id="customers"> 
<tr ALIGN=CENTER>
<TH BGCOLOR="FF6666" COLSPAN=5>Evoluci&oacute;n de las aplicaciones web.</TH></TD>
</TR>
<TR ALIGN=CENTER>
    <TD BGCOLOR="FF9999">Hitos</TD>
    <TD BGCOLOR="FFCCCC" colspan=2>Hechos</TD>
    <TD BGCOLOR="FF9999">Im&aacute;genes</TD>
    <TD BGCOLOR="FFCCCC">Referencias</TD>
</TR>

<TD BGCOLOR="FF6666" ROWSPAN=9> &nbsp;Internet&nbsp; </TD>

<TR ALIGN=CENTER>
<TH BGCOLOR="b66d6d">&nbsp;1957&nbsp; </TH>
<TD BGCOLOR="#e67878">&nbsp;Agencia de proyectos de investigaciones avanzadas (ARPA).&nbsp;</TD>
<TH BGCOLOR="FF6666" ROWSPAN=9> <img src="internet.jpg" height="200" width="300"> </TH>
<TD BGCOLOR="#e67878"ROWSPAN=51> 
    <ul>
        <li>Berners-Lee, T. (1999). Weaving the Web: The Original Design and Ultimate Destiny of the World
            Wide Web by its Inventor.
            HarperCollins.</li>
        <li>World Wide Web Consortium (W3C). (2001). Resource Description Framework (RDF): Concepts and
            Abstract Syntax. W3C
            Recommendation. 22 February 2001.</li>
        <li>World Wide Web Consortium (W3C). (2004). OWL Web Ontology Language Overview. W3C Recommendation.
            10 February 2004.
            <a href="https://www.w3.org/TR/2004/REC-owl-features-20040210/">Enlace</a>
        </li>
        <li>Brickley, D., & Miller, L. (2004). FOAF: Friend-of-a-Friend. Namespace Document. January 14,
            2004.</li>
        <li>Bizer, C., Heath, T., & Berners-Lee, T. (2009). Linked Data - The Story So Far. International
            Journal on Semantic Web
            Research, 5(3), 1-22.</li>
        <li>World Wide Web Consortium (W3C). (2020). Semantic Web Use Cases and Applications. W3C Note. 27
            February 2020.</li>
    </ul>    
</TD>
</TR>

<TR ALIGN=CENTER>
<TH BGCOLOR="#e67878">&nbsp;1961&nbsp; </TH>
<TD BGCOLOR="b66d6d">&nbsp;Leonard Kleinrock public&oacute; desde el MIT el primer documento sobre la teor&iacute;a de conmutaci&oacute;n de paquetes.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
<TH BGCOLOR="b66d6d">&nbsp;1967&nbsp; </TH>
<TD BGCOLOR="#e67878">&nbsp;Hombre llega a la luna. Marca el inicio de las comunicaciones globales.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
<TH BGCOLOR="#e67878">&nbsp;1969&nbsp; </TH>
<TD BGCOLOR="b66d6d">&nbsp;Se estableci&oacute; la primera conexi&oacute;n de computadoras, conocida como ARPANET,entre 3 universidades en California y una en Utah, Estados Unidos. &nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
<TH BGCOLOR="b66d6d">&nbsp;1983&nbsp; </TH>
<TD BGCOLOR="#e67878">&nbsp;ARPANET cambi&oacute; el protocolo NCP por TCP/IP.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
<TH BGCOLOR="#e67878">&nbsp;1989&nbsp; </TH>
<TD BGCOLOR="b66d6d">&nbsp;Integraci&oacute;n de los protocolos OSI en la arquitectura de internet, facilitando el uso de distintos protocolos de comunicaciones.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
<TH BGCOLOR="b66d6d">&nbsp;1990&nbsp; </TH>
<TD BGCOLOR="#e67878">&nbsp;ARPANET se desmantela y aparecen:
    <li>MILNET: Car&aacute;cter militar</li>
    <li>INTERNET: Naturaleza publica, orientada al mundo acad&eacute;mico, cient&iacute;fico e industrial.</li></TD>
</TR>

<TR ALIGN=CENTER>
<TH BGCOLOR="#e67878">&nbsp;2006&nbsp; </TH>
<TD BGCOLOR="b66d6d">&nbsp;Internet alcanz&oacute; los mil cien millones de usuarios. Se prev&eacute; que la cantidad de navegantes de la Red aumentar&aacute; a 2,000 millones.&nbsp;</TD>
</TR>




<TD BGCOLOR="FF9999" ROWSPAN=10>&nbsp;Web 1.0&nbsp;</TD>

<TR ALIGN=CENTER>
    <TH BGCOLOR="b66d6d">&nbsp;1989-1991&nbsp;</TH>
    <TD BGCOLOR="#e67878">&nbsp;Tim Berners-Lee invent&oacute; la World Wide Web en el CERN (Organizaci&oacute;n Europea para la Investigaci&oacute;n Nuclear) como un sistema para compartir informaci&oacute;n cient&iacute;fica en l&iacute;nea.&nbsp;</TD>
    <TD BGCOLOR="FF9999" ROWSPAN=9> <img src="Web 1.0.png" height="200" width="300"> </TD> </TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="#e67878">&nbsp;1991-1993&nbsp;</TH>
    <TD BGCOLOR="b66d6d">&nbsp;Se lanzan los primeros navegadores web, como WorldWideWeb (m&aacute;s tarde renombrado Nexus) y NCSA Mosaic. Estos navegadores permiten la visualizaci&oacute;n de p&aacute;ginas web mediante el hipertexto.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="b66d6d">&nbsp;1994&nbsp;</TH>
    <TD BGCOLOR="#e67878">&nbsp;Marc Andreessen y Eric Bina desarrollan el navegador web Netscape Navigator, que se convierte en uno de los navegadores m&aacute;s populares de la &eacute;poca.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="#e67878">&nbsp;1995&nbsp;</TH>
    <TD BGCOLOR="b66d6d">&nbsp;Se funda eBay y Amazon.com, dos de los primeros sitios web comerciales importantes. Adem&aacute;s, se lanza Windows 95, que incluye soporte integrado para TCP/IP y acceso a Internet.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="b66d6d">&nbsp;1995&nbsp;</TH>
    <TD BGCOLOR="#e67878">&nbsp;Se lanza Windows 95 con soporte integrado para TCP/IP y acceso a Internet, lo que facilita la conexi&oacute;n de los usuarios a la web.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="#e67878">&nbsp;1996&nbsp;</TH>
    <TD BGCOLOR="b66d6d">&nbsp;Marc Andreessen y Eric Bina desarrollan el navegador web Netscape Navigator, que se convierte en uno de los navegadores m&aacute;s populares de la &eacute;poca.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="b66d6d">&nbsp;1996&nbsp;</TH>
    <TD BGCOLOR="#e67878">&nbsp;Se lanza Google como un motor de b&uacute;squeda.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="#e67878">&nbsp;1997&nbsp;</TH>
    <TD BGCOLOR="b66d6d">&nbsp;Se lanza el servicio de correo electr&oacute;nico gratuito Hotmail.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="b66d6d">&nbsp;1998&nbsp;</TH>
    <TD BGCOLOR="#e67878">&nbsp; Se funda PayPal como un servicio de pago en l&iacute;nea.&nbsp;</TD>
</TR>



<TD BGCOLOR="FF6666" ROWSPAN=11>&nbsp;Web 2.0&nbsp;</TD>

<TR ALIGN=CENTER>
    <TH BGCOLOR="#e67878">&nbsp;2000&nbsp;</TH>
    <TD BGCOLOR="b66d6d">&nbsp; Las aplicaciones web comienzan a adoptar interactividad y colaboraci&oacute;n, permitiendo a los usuarios contribuir con contenido y participar activamente en la creaci&oacute;n de la web.&nbsp;</TD>
    <TD BGCOLOR="FF6666" ROWSPAN=11> <img src="Web 2.0.png" height="200" width="300"> </TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="b66d6d">&nbsp;2002&nbsp;</TH>
    <TD BGCOLOR="#e67878">&nbsp;Se lanza Blogger, una plataforma de blogs que facilita la publicaci&oacute;n de contenidos en l&iacute;nea.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="#e67878">&nbsp;2003&nbsp;</TH>
    <TD BGCOLOR="b66d6d">&nbsp;Se lanza WordPress, otra plataforma de blogs que ofrece mayor flexibilidad y personalizaci&oacute;n.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="b66d6d">&nbsp;2004&nbsp;</TH>
    <TD BGCOLOR="#e67878">&nbsp;Se lanza Facebook, inicialmente como una red social exclusiva para estudiantes de la Universidad de Harvard, pero luego se expande a otras universidades y al p&uacute;blico en general.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="#e67878">&nbsp;2005&nbsp;</TH>
    <TD BGCOLOR="b66d6d">&nbsp;Se lanza YouTube, una plataforma para compartir v&iacute;deos en l&iacute;nea que revoluciona la forma en que se consume contenido audiovisual en la web.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="b66d6d">&nbsp;2006&nbsp;</TH>
    <TD BGCOLOR="#e67878">&nbsp;Twitter se lanza al p&uacute;blico, permitiendo a los usuarios enviar y leer mensajes cortos de texto, conocidos como "tweets".&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="#e67878">&nbsp;2007&nbsp;</TH>
    <TD BGCOLOR="b66d6d">&nbsp;Apple lanza el iPhone, popularizando los tel&eacute;fonos inteligentes y cambiando la forma en que la gente accede a Internet y utiliza aplicaciones web.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="b66d6d">&nbsp;2007&nbsp;</TH>
    <TD BGCOLOR="#e67878">&nbsp;Se lanza Spotify, un servicio de streaming de m&uacute;sica que ofrece acceso a una amplia biblioteca de canciones bajo demanda.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="#e67878">&nbsp;2008&nbsp;</TH>
    <TD BGCOLOR="b66d6d">&nbsp;Se lanza Google Chrome, un navegador web desarrollado por Google que introduce caracter&iacute;sticas avanzadas y un enfoque en el rendimiento y la seguridad.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="b66d6d">&nbsp;2009&nbsp;</TH>
    <TD BGCOLOR="#e67878">&nbsp;Se lanza WhatsApp, una aplicaci&oacute;n de mensajer&iacute;a instant&aacute;nea que permite a los usuarios enviar mensajes de texto, im&aacute;genes, videos y mensajes de voz a trav&eacute;s de Internet.&nbsp;</TD>
</TR>



<TD BGCOLOR="FF9999" ROWSPAN=13>&nbsp;Web 3.0&nbsp;</TD>

<TR ALIGN=CENTER>
    <TH BGCOLOR="#e67878">&nbsp;2001&nbsp;</TH>
    <TD BGCOLOR="b66d6d">&nbsp;Tim Berners-Lee, considerado el padre de la World Wide Web, presenta por primera vez el concepto de la Web Sem&aacute;ntica, que se convertir&iacute;a en un componente fundamental de la Web 3.0.&nbsp;</TD>
    <TD BGCOLOR="FF9999" ROWSPAN=13> <img src="Web 3.0.png" height="200" width="300"> </TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="b66d6d">&nbsp;2006&nbsp;</TH>
    <TD BGCOLOR="#e67878">&nbsp;Se publica el libro "La Web Sem&aacute;ntica" de Tom Gruber y James Hendler, que explora en profundidad los principios y aplicaciones de la Web Sem&aacute;ntica.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="#e67878">&nbsp;2007&nbsp;</TH>
    <TD BGCOLOR="b66d6d">&nbsp;Google lanza el proyecto Freebase, una base de datos de conocimiento de c&oacute;digo abierto destinada a proporcionar informaci&oacute;n estructurada y enlazada que pueda ser utilizada por humanos y m&aacute;quinas por igual.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="b66d6d">&nbsp;2009&nbsp;</TH>
    <TD BGCOLOR="#e67878">&nbsp;Se lanza Bitcoin, la primera criptomoneda descentralizada basada en blockchain, sentando las bases para la descentralizaci&oacute;n en la Web 3.0.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="#e67878">&nbsp;2013&nbsp;</TH>
    <TD BGCOLOR="b66d6d">&nbsp;Vitalik Buterin propone Ethereum, una plataforma de computaci&oacute;n descentralizada que permite la ejecuci&oacute;n de contratos inteligentes y la creaci&oacute;n de aplicaciones descentralizadas (DApps).&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="b66d6d">&nbsp;2015&nbsp;</TH>
    <TD BGCOLOR="#e67878">&nbsp;Ethereum se lanza oficialmente, brindando a los desarrolladores la capacidad de construir DApps y contratos inteligentes utilizando su blockchain.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="#e67878">&nbsp;2017&nbsp;</TH>
    <TD BGCOLOR="b66d6d">&nbsp;La popularidad de las criptomonedas y las ICOs (Ofertas Iniciales de Monedas) alcanza su punto m&aacute;ximo, atrayendo una gran atenci&oacute;n hacia la tecnolog&iacute;a blockchain y sus aplicaciones potenciales.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="b66d6d">&nbsp;2018&nbsp;</TH>
    <TD BGCOLOR="#e67878">&nbsp;Se lanza Filecoin, un protocolo de almacenamiento de datos descentralizado basado en blockchain que permite a los usuarios almacenar, compartir y vender datos de manera segura y eficiente.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="#e67878">&nbsp;2019&nbsp;</TH>
    <TD BGCOLOR="b66d6d">&nbsp;Se lanza el Proyecto Solid, iniciado por Tim Berners-Lee, con el objetivo de crear una plataforma descentralizada donde los usuarios puedan almacenar sus datos de manera segura y controlar qui&eacute;n accede a ellos.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="b66d6d">&nbsp;2020&nbsp;</TH>
    <TD BGCOLOR="#e67878">&nbsp;La DeFi (Finanzas Descentralizadas) experimenta un r&aacute;pido crecimiento, con aplicaciones financieras construidas sobre blockchains como Ethereum, permitiendo transacciones financieras sin intermediarios tradicionales.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="#e67878">&nbsp;2021&nbsp;</TH>
    <TD BGCOLOR="b66d6d">&nbsp;Los NFT (Tokens No Fungibles) se vuelven populares como una forma de autenticar y vender obras de arte digitales y otros activos digitales &uacute;nicos en el blockchain.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="b66d6d">&nbsp;2022&nbsp;</TH>
    <TD BGCOLOR="#e67878">&nbsp;Se produce un aumento significativo en el desarrollo de metaversos y mundos virtuales descentralizados, donde los usuarios pueden interactuar, crear y poseer activos digitales en entornos virtuales compartidos.&nbsp;</TD>
</TR>





<TD BGCOLOR="FF6666" ROWSPAN=9> &nbsp;Web 4.0&nbsp; </TD>

<TR ALIGN=CENTER>
    
    <TH BGCOLOR="#e67878">&nbsp;2020&nbsp;</TH>
    <TD BGCOLOR="b66d6d">&nbsp;Continuaci&oacute;n del desarrollo de la inteligencia artificial (IA) y el aprendizaje autom&aacute;tico, con avances significativos en &aacute;reas como el procesamiento del lenguaje natural, la visi&oacute;n por computadora y la toma de decisiones aut&oacute;nomas.&nbsp;</TD>
    <TD BGCOLOR="FF6666" ROWSPAN=9> <img src="Web 4.0.png" height="200" width="300"> </TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="b66d6d">&nbsp;2020&nbsp;</TH>
    <TD BGCOLOR="#e67878">&nbsp;Mayor adopci&oacute;n de la realidad aumentada (AR) y la realidad virtual (VR) en una variedad de aplicaciones web, desde el comercio electr&oacute;nico hasta la educaci&oacute;n y el entretenimiento.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="#e67878">&nbsp;2021&nbsp;</TH>
    <TD BGCOLOR="b66d6d">&nbsp;Aumento de la automatizaci&oacute;n en una amplia gama de sectores y aplicaciones, con sistemas inteligentes que pueden realizar tareas complejas y adaptarse din&aacute;micamente a diferentes situaciones.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="b66d6d">&nbsp;2021&nbsp;</TH>
    <TD BGCOLOR="#e67878">&nbsp;Avances en la ciberseguridad y la privacidad de los datos, con la adopci&oacute;n generalizada de tecnolog&iacute;as como la encriptaci&oacute;n homom&oacute;rfica y la computaci&oacute;n confidencial, que garantizan la protecci&oacute;n de la informaci&oacute;n personal y sensible.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="#e67878">&nbsp;2022&nbsp;</TH>
    <TD BGCOLOR="b66d6d">&nbsp;Integraci&oacute;n m&aacute;s profunda de la Internet de las Cosas (IoT) en la infraestructura web, con dispositivos conectados que se comunican de manera m&aacute;s inteligente y colaborativa, creando sistemas m&aacute;s eficientes y aut&oacute;nomos.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="b66d6d">&nbsp;2023&nbsp;</TH>
    <TD BGCOLOR="#e67878">&nbsp;Avances en la computaci&oacute;n cu&aacute;ntica, con el desarrollo de algoritmos y sistemas cu&aacute;nticos m&aacute;s potentes que pueden resolver problemas computacionales complejos de manera m&aacute;s eficiente y r&aacute;pida.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="#e67878">&nbsp;2023&nbsp;</TH>
    <TD BGCOLOR="b66d6d">&nbsp;Mayor integraci&oacute;n de la Web 3D y los entornos virtuales en la experiencia web, con la creaci&oacute;n de mundos virtuales compartidos y persistentes que permiten a los usuarios interactuar, crear y colaborar en tiempo real.&nbsp;</TD>
</TR>

<TR ALIGN=CENTER>
    <TH BGCOLOR="b66d6d">&nbsp;2024&nbsp;</TH>
    <TD BGCOLOR="#e67878">&nbsp;Desarrollo de econom&iacute;as digitales m&aacute;s maduras y diversificadas, con la tokenizaci&oacute;n de una amplia gama de activos f&iacute;sicos y virtuales y la creaci&oacute;n de nuevos modelos de negocio basados ​​en la propiedad y el intercambio de activos digitales.&nbsp;</TD>
</TR>

    </table>
    </center>

    <br>
    <br>
    <P ALIGN=RIGHT>
        <a href="https://www.w3schools.com/"> https://www.w3schools.com/ </a>
    </p>
</body>
</html>